# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\minime\Downloads\Rosendyne\PSoC Creator\WaveGen\SinOutputWithReporting.cydsn\SinOutputWithReporting.cyprj
# Date: Thu, 17 Jun 2021 12:07:24 GMT
#set_units -time ns
create_clock -name {AnalogClock(routed)} -period 500000 -waveform {0 250000} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {WaveFormReader_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {AnalogClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12001 24001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Users\minime\Downloads\Rosendyne\PSoC Creator\WaveGen\SinOutputWithReporting.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\minime\Downloads\Rosendyne\PSoC Creator\WaveGen\SinOutputWithReporting.cydsn\SinOutputWithReporting.cyprj
# Date: Thu, 17 Jun 2021 12:07:13 GMT
